ci4tutorial/app/Controllers/News.php

INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('안녕하세요 1', '안녕하세요-1', '글 작성부분입니다.1')
---
	public function create()
    {
        $model = model(NewsModel::class);

        if ($this->request->getMethod() === 'post' && $this->validate([
            'title' => 'required|min_length[3]|max_length[255]',
            'body'  => 'required',
        ])) {
            $model->save([
                'title' => $this->request->getPost('title'),
                'slug'  => url_title($this->request->getPost('title'), '-', true),
                'body'  => $this->request->getPost('body'),
            ]);